"""Пользователь вводит номер буквы в алфавите. Определить, какая это буква"""
a = int(input('Введите номер буквы: '))
alp = chr(a + 96)
print(f'Эта буква {alp}')
